Write Notebook contents here
2518 최재원 2118 최정민
행성을 디자인했다. 먼저 행성의 전체으로 물리적으로 성립할 수 있는 행성의 모형을 만들었다.
먼저 이 행성이 속해 있는 항성계의 항성의 질량은 태양질량의 2배이다. 그리고 그 곳과 2AU 떨어진 곳에 중심 행성이 위치해 있다. 대략 그 행성의 물리량들은 현재 태양계의 목성과 비슷하다. 이 행성을 지금부터 목성으로 부르기로 하자.
그리고 목성 안의 우리가 만든 행성이 있다. 이 행성의 물리량은 대략 지구와 비슷하며 목성 주위를 공전한다. 이 행성은 이심률이 큰 궤도를 공전하며 근일점에서는 매우 큰 조석력을 받는다. 이 행성을 지구라고 하자.
목성의 물리량은 수소가 89.8%이고 목성 반지름은 69911km이다. 표면중력은 24.79m/s^2이다. 지구의 표면 중력은 9.7m/s^2이고 목성의 밀도는 1.33g/cm^3이고 지구의 밀도는 5.51g/cm^3이다. 지구의 반지름 6400km 이다.
위의 값들을 이용하여 로쉬한계를 계산하면
d  = 1.26R(목성밀도/지구밀도)^1/3이므로 로쉬한게는 5021km이다.
이 때 근일점에서의 중력은 15.09m/s^2이고 근일점의 반지름은 69911km로 거의 목성에 접하게 지나게 된다.
그러므로 이 지구가 목성에 접할 때 목성의 수소를 가져와 에너지 원으로 사용하고 조석력으로 지열발전을 할 수 있다.
그리고 기체형 행성일 때 d가 R보다 작아 동주기 자전을 하기 때문에 중력을 이용해 달력을 만들어야 한다.
하루는 그 행성의 자전으로 계산하며 지구의 자전은 공전궤도면에 수직하게 자전한다.
월은 목성 중심으로 공전한다. (중력이 바뀌는 것으로 생각한다.)
년은 항성 중심으로 공전한다.
